tylertms/dspic33e-sim/conformance/spi.c
static void receive_only_cases(SpiConformance* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_SPI_COUNT; channel++) {
        uint8_t master;
        for (master = 0u; master < 2u; master++) {
            uint8_t mode16;
            for (mode16 = 0u; mode16 < 2u; mode16++) {
                uint16_t base = bases[channel];
                uint16_t control = (uint16_t)(0x081bu | ((uint16_t)master << 5u) |
                                              ((uint16_t)mode16 << 10u));
                uint16_t received = (uint16_t)(0xd500u | ((uint16_t)channel << 4u) |
                                               ((uint16_t)master << 3u) | mode16);
                uint16_t expected = mode16 != 0u ? received : received & 0x00ffu;
                uint64_t cycles = master != 0u ? transfer_cycles(control) : 1u;
                uint8_t value;
                bool scheduled;

                dspic33_reset(cpu, 0u);
                configure_spi(cpu, channel, control, 0u, 0u);
                scheduled = dspic33_spi_receive(cpu, channel, received, cycles);
                dspic33_write_word(cpu, (uint16_t)(base + 8u), 0xa55au);
                expect(state,
                       cpu->io.spi_tx[channel].count == 0u &&
                           !dspic33_spi_transmit(cpu, channel, &value),
                       "receive-only suppresses serial output");
                expect(state, scheduled && dspic33_device_advance(cpu, cycles),
                       "receive-only transfer completes");
                expect(state, dspic33_read_word(cpu, (uint16_t)(base + 8u)) == expected,
                       "receive-only retains input");
                expect(state, interrupt_flag(cpu, irqs[channel]),
                       "receive-only raises transfer interrupt");
                expect(state, cpu->io.spi_tx[channel].count == 0u,
                       "receive-only transfer emits no output");

                clear_interrupt(cpu, irqs[channel]);
                dspic33_write_word(cpu, (uint16_t)(base + 2u),
                                   (uint16_t)(control & ~0x0800u));
                dspic33_write_word(cpu, (uint16_t)(base + 8u), 0x5aa5u);
                expect(state,
                       dspic33_spi_transmit(cpu, channel, &value) && value == 0xa5u &&
                           cpu->io.spi_tx[channel].count == (mode16 != 0u ? 1u : 0u),
                       "serial output resumes after receive-only mode");
            }
        }
    }
}

static void physical_slave_input_cases(SpiConformance* state, Dspic33* cpu,
                                       Dspic33* copy) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_SPI_COUNT; channel++) {
        uint8_t mode16;
        for (mode16 = 0u; mode16 < 2u; mode16++) {
            uint8_t polarity;
            for (polarity = 0u; polarity < 2u; polarity++) {
                uint8_t edge;
                for (edge = 0u; edge < 2u; edge++) {
                    uint16_t base = bases[channel];
                    uint16_t control =
                        (uint16_t)(((uint16_t)mode16 << 10u) | ((uint16_t)edge << 8u) |
                                   0x0080u | ((uint16_t)polarity << 6u) | 0x001bu);
                    uint16_t received = (uint16_t)(0xa500u | ((uint16_t)channel << 4u) |
                                                   ((uint16_t)polarity << 2u) |
                                                   ((uint16_t)edge << 1u) | mode16);
                    uint16_t expected = mode16 != 0u ? received : received & 0x00ffu;
                    uint8_t width = mode16 != 0u ? 16u : 8u;
                    bool idle = polarity != 0u;
                    bool accepted = true;
                    uint8_t index;

                    dspic33_reset(cpu, 0u);
                    accepted &= dspic33_spi_pin_input(cpu, channel, idle, false, false);
                    configure_spi(cpu, channel, control, 0u, 0u);
                    for (index = 0u; index < width; index++) {
                        bool high =
                            (received & (uint16_t)(1u << (width - index - 1u))) != 0u;
                        accepted &=
                            dspic33_spi_pin_input(cpu, channel, !idle, high, false);
                        accepted &=
                            dspic33_spi_pin_input(cpu, channel, idle, high, false);
                        if (index + 1u != width) {
                            accepted &= !interrupt_flag(cpu, irqs[channel]);
                        }
                    }
                    expect(state, accepted, "physical slave accepts exact clock edges");
                    expect(state,
                           interrupt_flag(cpu, irqs[channel]) &&
                               dspic33_read_word(cpu, (uint16_t)(base + 8u)) ==
                                   expected,
                           "physical slave receives serial input");

                    clear_interrupt(cpu, irqs[channel]);
                    accepted = dspic33_spi_pin_input(cpu, channel, idle, false, true);
                    for (index = 0u; index < width; index++) {
                        accepted &=
                            dspic33_spi_pin_input(cpu, channel, !idle, true, true);
                        accepted &=
                            dspic33_spi_pin_input(cpu, channel, idle, true, true);
                    }
                    expect(state,
                           accepted && !interrupt_flag(cpu, irqs[channel]) &&
                               (dspic33_read_word(cpu, base) & 1u) == 0u,
                           "deselected physical slave ignores serial input");
                }
            }
        }
    }
    for (channel = 0u; channel < DSPIC33_SPI_COUNT; channel++) {
        uint8_t polarity;
        for (polarity = 0u; polarity < 2u; polarity++) {
            uint16_t base = bases[channel];
            uint16_t received =
                (uint16_t)(0x0060u | ((uint16_t)channel << 1u) | polarity);
            bool active = polarity != 0u;
            bool accepted = true;
            uint8_t index;

            dspic33_reset(cpu, 0u);
            accepted &= dspic33_spi_pin_input(cpu, channel, false, false, !active);
            configure_spi(cpu, channel, 0x001bu,
                          (uint16_t)(0xc000u | ((uint16_t)polarity << 13u)), 0u);
            accepted &= dspic33_spi_pin_input(cpu, channel, false, false, active);
            for (index = 0u; index < 8u; index++) {
                bool high = (received & (uint16_t)(0x0080u >> index)) != 0u;
                accepted &= dspic33_spi_pin_input(cpu, channel, true, high, active);
                accepted &= dspic33_spi_pin_input(cpu, channel, false, high, active);
            }
            expect(state,
                   accepted && interrupt_flag(cpu, irqs[channel]) &&
                       dspic33_read_word(cpu, (uint16_t)(base + 8u)) == received,
                   "framed slave accepts selected physical input");

            clear_interrupt(cpu, irqs[channel]);
            accepted = dspic33_spi_pin_input(cpu, channel, false, false, !active);
            for (index = 0u; index < 8u; index++) {
                accepted &= dspic33_spi_pin_input(cpu, channel, true, true, !active);
                accepted &= dspic33_spi_pin_input(cpu, channel, false, true, !active);
            }
            expect(state, accepted && !interrupt_flag(cpu, irqs[channel]),
                   "framed slave rejects inactive physical input");
        }
    }
    expect(state, !dspic33_spi_pin_input(cpu, DSPIC33_SPI_COUNT, false, false, false),
           "physical slave rejects invalid channel");

    dspic33_reset(cpu, 0u);
    dspic33_spi_pin_input(cpu, 0u, false, false, false);
    configure_spi(cpu, 0u, 0x049bu, 0u, 0u);
    for (uint8_t index = 0u; index < 8u; index++) {
        bool high = (0xa55au & (uint16_t)(1u << (15u - index))) != 0u;
        dspic33_spi_pin_input(cpu, 0u, true, high, false);
        dspic33_spi_pin_input(cpu, 0u, false, high, false);
    }
    expect(state, dspic33_copy(copy, cpu), "copy partial physical slave input");
    expect(state,
           copy->io.spi_pin_bits[0] == 8u && copy->io.spi_pin_receive[0] == 0x00a5u,
           "copied physical slave retains partial word");
    for (uint8_t index = 8u; index < 16u; index++) {
        bool high = (0xa55au & (uint16_t)(1u << (15u - index))) != 0u;
        dspic33_spi_pin_input(copy, 0u, true, high, false);
        dspic33_spi_pin_input(copy, 0u, false, high, false);
    }
    expect(state,
           interrupt_flag(copy, irqs[0]) && dspic33_read_word(copy, 0x0248u) == 0xa55au,
           "copied physical slave completes independently");
    expect(state,
           !interrupt_flag(cpu, irqs[0]) && cpu->io.spi_pin_bits[0] == 8u &&
               cpu->io.spi_pin_receive[0] == 0x00a5u,
           "source physical slave remains partial");
    dspic33_reset(cpu, 0u);
    expect(state,
           cpu->io.spi_pin_bits[0] == 0u && cpu->io.spi_pin_receive[0] == 0u &&
               cpu->io.spi_pin_clock_high == 0u && cpu->io.spi_pin_select_high == 0u,
           "reset clears physical slave state");
}

static void timing_matrix_cases(SpiConformance* state, Dspic33* cpu) {
    uint8_t channel;
    uint8_t mode16;
    uint8_t primary;
    uint8_t secondary;
    for (channel = 0u; channel < DSPIC33_SPI_COUNT; channel++) {
        for (mode16 = 0u; mode16 < 2u; mode16++) {
            for (primary = 0u; primary < 4u; primary++) {
                for (secondary = 0u; secondary < 8u; secondary++) {
                    uint16_t control;
                    uint16_t sent;
                    uint16_t received;
                    uint64_t cycles;
                    if (primary == 3u && secondary == 7u) {
                        continue;
                    }
                    control =
                        (uint16_t)(0x0020u | primary | ((uint16_t)secondary << 2u) |
                                   (mode16 != 0u ? 0x0400u : 0u));
                    sent = (uint16_t)(0x8100u | (channel << 4u) | (primary << 2u) |
                                      (secondary & 3u));
                    received = (uint16_t)(0x5a00u | (secondary << 4u) | primary);
                    cycles = transfer_cycles(control);
                    dspic33_reset(cpu, 0u);
                    configure_spi(cpu, channel, control, 0u, 0u);
                    expect(state, dspic33_spi_receive(cpu, channel, received, cycles),
                           "schedule master response matrix");
                    dspic33_write_word(cpu, (uint16_t)(bases[channel] + 8u), sent);
                    expect(state,
                           (dspic33_read_word(cpu, bases[channel]) & 0x0080u) == 0u,
                           "matrix shift register active");
                    expect(state, dspic33_device_advance(cpu, cycles - 1u),
                           "matrix advance before completion");
                    expect(state,
                           (dspic33_read_word(cpu, bases[channel]) & 0x0001u) == 0u,
                           "matrix not complete early");
                    expect(state, dspic33_device_advance(cpu, 1u),
                           "matrix completion advance");
                    expect(state,
                           (dspic33_read_word(cpu, bases[channel]) & 0x0001u) != 0u,
                           "matrix receive flag");
                    expect(
                        state,
                        dspic33_read_word(cpu, (uint16_t)(bases[channel] + 8u)) ==
                            (mode16 != 0u ? received : (uint16_t)(received & 0x00ffu)),
                        "matrix received value");
                    expect(state, interrupt_flag(cpu, irqs[channel]),
                           "matrix transfer interrupt");
                }
            }
        }
    }
}

static void standard_buffer_cases(SpiConformance* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_SPI_COUNT; channel++) {
        uint16_t base = bases[channel];
        uint16_t control = 0x043bu;
        uint64_t cycles = transfer_cycles(control);
        dspic33_reset(cpu, 0u);
        configure_spi(cpu, channel, control, 0u, 0u);
        expect(state,
               dspic33_spi_receive(cpu, channel, 0x1111u, cycles) &&
                   dspic33_spi_receive(cpu, channel, 0x2222u, cycles * 2u),
               "queue standard responses");
        dspic33_write_word(cpu, (uint16_t)(base + 8u), 0xaaaau);
        dspic33_write_word(cpu, (uint16_t)(base + 8u), 0xbbbbu);
        expect(state, (dspic33_read_word(cpu, base) & 0x0002u) != 0u,
               "standard transmit buffer full");
        dspic33_write_word(cpu, (uint16_t)(base + 8u), 0xccccu);
        expect(state, cpu->io.spi_tx_fifo[channel].count == 1u,
               "standard full write ignored");
        expect(state, dspic33_device_advance(cpu, cycles), "standard first completion");
        expect(state, (dspic33_read_word(cpu, base) & 0x0002u) == 0u,
               "standard queued word moved to shift");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 8u)) == 0x1111u,
               "standard first response order");
        clear_interrupt(cpu, irqs[channel]);
        expect(state, dspic33_device_advance(cpu, cycles),
               "standard second completion");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 8u)) == 0x2222u,
               "standard second response order");
        expect(state, interrupt_flag(cpu, irqs[channel]), "standard second interrupt");

        dspic33_reset(cpu, 0u);
        configure_spi(cpu, channel, 0u, 0u, 0u);
        expect(state,
               dspic33_spi_receive(cpu, channel, 0x0031u, 1u) &&
                   dspic33_spi_receive(cpu, channel, 0x0032u, 2u),
               "queue standard slave overflow");
        expect(state, dspic33_device_advance(cpu, 2u),
               "standard slave overflow advance");
        expect(state, (dspic33_read_word(cpu, base) & 0x0041u) == 0x0041u,
               "standard overflow flags");
        expect(state, interrupt_flag(cpu, error_irqs[channel]),
               "standard overflow error interrupt");
        dspic33_write_word(cpu, base,
                           (uint16_t)(dspic33_read_word(cpu, base) & ~0x0040u));
        expect(state, (dspic33_read_word(cpu, base) & 0x0040u) == 0u,
               "standard overflow software clear");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 8u)) == 0x0031u,
               "standard overflow preserves unread value");
        expect(state,
               dspic33_spi_receive(cpu, channel, 0x0033u, 1u) &&
                   dspic33_device_advance(cpu, 1u),
               "standard receive resumes after clear");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 8u)) == 0x0033u,
               "standard recovered receive value");
    }
}

static void enhanced_fifo_cases(SpiConformance* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_SPI_COUNT; channel++) {
        uint16_t base = bases[channel];
        uint16_t control = 0x043bu;
        uint64_t cycles = transfer_cycles(control);
        uint8_t index;
        dspic33_reset(cpu, 0u);
        configure_spi(cpu, channel, control, 1u, 5u);
        for (index = 0u; index < 9u; index++) {
            dspic33_write_word(cpu, (uint16_t)(base + 8u), (uint16_t)(0x1000u + index));
        }
        expect(state, cpu->io.spi_tx_fifo[channel].count == 8u,
               "enhanced eight pending words");
        expect(state, (dspic33_read_word(cpu, base) & 0x0702u) == 0x0702u,
               "enhanced full count encoding");
        dspic33_write_word(cpu, (uint16_t)(base + 8u), 0xdeadu);
        expect(state, cpu->io.spi_tx_fifo[channel].count == 8u,
               "enhanced full write ignored");
        for (index = 0u; index < 9u; index++) {
            expect(state, dspic33_device_advance(cpu, cycles),
                   "enhanced transmit completion");
            expect(state,
                   dspic33_read_word(cpu, (uint16_t)(base + 8u)) ==
                       (uint16_t)(0x1000u + index),
                   "enhanced transmit receive order");
        }
        expect(state, (dspic33_read_word(cpu, base) & 0x00a2u) == 0x00a0u,
               "enhanced queues empty");
        expect(state, interrupt_flag(cpu, irqs[channel]),
               "enhanced final completion interrupt");

        dspic33_reset(cpu, 0u);
        configure_spi(cpu, channel, 0x0400u, 1u, 3u);
        for (index = 0u; index < 8u; index++) {
            expect(state,
                   dspic33_spi_receive(cpu, channel, (uint16_t)(0x3000u + index), 1u) &&
                       dspic33_device_advance(cpu, 1u),
                   "enhanced slave receive fill");
        }
        expect(state, cpu->io.spi_rx_fifo[channel].count == 8u,
               "enhanced receive depth");
        expect(state, (dspic33_read_word(cpu, base) & 0x0721u) == 0x0701u,
               "enhanced receive full status");
        expect(state, interrupt_flag(cpu, irqs[channel]),
               "enhanced receive full interrupt");
        clear_interrupt(cpu, irqs[channel]);
        expect(state,
               dspic33_spi_receive(cpu, channel, 0x3fffu, 1u) &&
                   dspic33_device_advance(cpu, 1u),
               "enhanced overflow advance");
        expect(state, (dspic33_read_word(cpu, base) & 0x0040u) != 0u,
               "enhanced overflow flag");
        expect(state, interrupt_flag(cpu, error_irqs[channel]),
               "enhanced overflow error interrupt");
        expect(state,
               dspic33_spi_receive(cpu, channel, 0x3eeeu, 1u) &&
                   dspic33_device_advance(cpu, 1u),
               "enhanced overflow blocks receive");
        expect(state, cpu->io.spi_rx_fifo[channel].count == 8u,
               "enhanced blocked receive preserves depth");
        dspic33_write_word(cpu, base,
                           (uint16_t)(dspic33_read_word(cpu, base) & ~0x0040u));
        expect(state, (dspic33_read_word(cpu, base) & 0x0040u) == 0u,
               "enhanced overflow software clear");
        expect(state, cpu->io.spi_rx_fifo[channel].count == 8u,
               "enhanced clear preserves unread words");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 8u)) == 0x3000u,
               "enhanced first preserved word");
        expect(state, cpu->io.spi_rx_fifo[channel].count == 7u,
               "enhanced read frees receive slot");
        expect(state,
               dspic33_spi_receive(cpu, channel, 0x3dddu, 1u) &&
                   dspic33_device_advance(cpu, 1u),
               "enhanced receive resumes after clear");
        expect(state, (dspic33_read_word(cpu, base) & 0x0040u) == 0u,
               "enhanced recovered receive avoids overflow");
        expect(state, cpu->io.spi_rx_fifo[channel].count == 8u,
               "enhanced recovered receive fills slot");
        for (index = 1u; index < 8u; index++) {
            expect(state,
                   dspic33_read_word(cpu, (uint16_t)(base + 8u)) ==
                       (uint16_t)(0x3000u + index),
                   "enhanced receive read order");
        }
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 8u)) == 0x3dddu,
               "enhanced recovered receive tail");
        expect(state, (dspic33_read_word(cpu, base) & 0x0021u) == 0x0020u,
               "enhanced receive empty status");
    }
}

static void interrupt_mode_cases(SpiConformance* state, Dspic33* cpu) {
    uint16_t base = bases[0];
    uint16_t master = 0x043bu;
    uint64_t cycles = transfer_cycles(master);
    uint8_t index;

    dspic33_reset(cpu, 0u);
    configure_spi(cpu, 0u, master, 1u, 7u);
    dspic33_write_word(cpu, (uint16_t)(base + 8u), 0x1000u);
    for (index = 0u; index < 7u; index++) {
        dspic33_write_word(cpu, (uint16_t)(base + 8u), (uint16_t)(0x1001u + index));
    }
    expect(state, !interrupt_flag(cpu, irqs[0]), "mode seven not early");
    dspic33_write_word(cpu, (uint16_t)(base + 8u), 0x1008u);
    expect(state, interrupt_flag(cpu, irqs[0]), "mode seven transmit full");

    dspic33_reset(cpu, 0u);
    configure_spi(cpu, 0u, master, 1u, 6u);
    dspic33_write_word(cpu, (uint16_t)(base + 8u), 0x2000u);
    expect(state, interrupt_flag(cpu, irqs[0]), "mode six transmit fifo empty");

    dspic33_reset(cpu, 0u);
    configure_spi(cpu, 0u, master, 1u, 5u);
    dspic33_write_word(cpu, (uint16_t)(base + 8u), 0x3000u);
    expect(state, !interrupt_flag(cpu, irqs[0]), "mode five not early");
    expect(state, dspic33_device_advance(cpu, cycles), "mode five completion advance");
    expect(state, interrupt_flag(cpu, irqs[0]), "mode five transfer complete");

    dspic33_reset(cpu, 0u);
    configure_spi(cpu, 0u, master, 1u, 4u);
    for (index = 0u; index < 9u; index++) {
        dspic33_write_word(cpu, (uint16_t)(base + 8u), (uint16_t)(0x4000u + index));
    }
    expect(state, !interrupt_flag(cpu, irqs[0]), "mode four not early");
    expect(state, dspic33_device_advance(cpu, cycles), "mode four opening advance");
    expect(state, interrupt_flag(cpu, irqs[0]), "mode four one opening");

    dspic33_reset(cpu, 0u);
    configure_spi(cpu, 0u, 0x0400u, 1u, 1u);
    expect(state,
           dspic33_spi_receive(cpu, 0u, 0x5000u, 1u) && dspic33_device_advance(cpu, 1u),
           "mode one receive advance");
    expect(state, interrupt_flag(cpu, irqs[0]), "mode one data received");

    dspic33_reset(cpu, 0u);
    configure_spi(cpu, 0u, 0x0400u, 1u, 2u);
    for (index = 0u; index < 5u; index++) {
        expect(state,
               dspic33_spi_receive(cpu, 0u, index, 1u) &&
                   dspic33_device_advance(cpu, 1u),
               "mode two below threshold advance");
    }
    expect(state, !interrupt_flag(cpu, irqs[0]), "mode two below threshold");
    expect(state,
           dspic33_spi_receive(cpu, 0u, 5u, 1u) && dspic33_device_advance(cpu, 1u),
           "mode two threshold advance");
    expect(state, interrupt_flag(cpu, irqs[0]), "mode two three quarters full");

    dspic33_reset(cpu, 0u);
    configure_spi(cpu, 0u, 0x0400u, 1u, 3u);
    for (index = 0u; index < 7u; index++) {
        expect(state,
               dspic33_spi_receive(cpu, 0u, index, 1u) &&
                   dspic33_device_advance(cpu, 1u),
               "mode three below full advance");
    }
    expect(state, !interrupt_flag(cpu, irqs[0]), "mode three below full");
    expect(state,
           dspic33_spi_receive(cpu, 0u, 7u, 1u) && dspic33_device_advance(cpu, 1u),
           "mode three full advance");
    expect(state, interrupt_flag(cpu, irqs[0]), "mode three receive full");

    dspic33_reset(cpu, 0u);
    configure_spi(cpu, 0u, 0x0400u, 1u, 0u);
    expect(state,
           dspic33_spi_receive(cpu, 0u, 0x6000u, 1u) && dspic33_device_advance(cpu, 1u),
           "mode zero receive advance");
    expect(state, !interrupt_flag(cpu, irqs[0]), "mode zero not on receive");
    expect(state, dspic33_read_word(cpu, (uint16_t)(base + 8u)) == 0x6000u,
           "mode zero read value");
    expect(state, interrupt_flag(cpu, irqs[0]), "mode zero receive empty");
}

